ci4/app/Cells/ArtikelTerkini.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
---
    public function render(?string $library = null, $params = null, int $ttl = 0, ?string $cacheName = null): string
    {
        $model = new ArtikelModel();
        $artikel = $model->orderBy('id', 'DESC')->limit(5)->findAll();