ci4/app/Controllers/Artikel.php

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('artikel ketiga', 'blabalablalablabalalabalablabalablaalablaalablablabal', 'artikel-ketiga')
---
    public function add()
    {
        // Validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
            ]);

SELECT *
FROM `artikel`
WHERE `id` = '3'
 LIMIT 1
---
    public function edit($id)
    {
        $artikel = new ArtikelModel();

        // Validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
            ]);
            return redirect('admin/artikel');
        }

        // Ambil data lama.
        $data = $artikel->where('id', $id)->first();